In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({

    'Product':['A','B','C'],
    'Jan':[100,150,130],
    'Feb':[110,160,140],
    'Mar':[105,155,135]

})

df.set_index('Product',inplace=True)

In [4]:
stacked_df = df.stack()

In [5]:
stacked_df

Product
A        Jan    100
         Feb    110
         Mar    105
B        Jan    150
         Feb    160
         Mar    155
C        Jan    130
         Feb    140
         Mar    135
dtype: int64

In [8]:
unstacked_df = stacked_df.unstack()

In [9]:
unstacked_df

         Jan  Feb  Mar
Product
A        100  110  105
B        150  160  155
C        130  140  135

In [21]:
df_reset = df.reset_index()

In [22]:
df_reset

   index Product  Jan  Feb  Mar
0      0       A  100  110  105
1      1       B  150  160  155
2      2       C  130  140  135

In [23]:
melted_df = pd.melt(df_reset,id_vars='Product',var_name='Month',value_name='Sales')

In [13]:
melted_df

  Product Month  Sales
0       A   Jan    100
1       B   Jan    150
2       C   Jan    130
3       A   Feb    110
4       B   Feb    160
5       C   Feb    140
6       A   Mar    105
7       B   Mar    155
8       C   Mar    135